DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериодаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодВалюты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаКурсовВалют/Forms/Форма/Ext/Form/Module.bsl
// хранит настройки обработки:
// -список валют по которым необходимо загружать курсы
// -код доступа к платным сервисам
// -режим работы
Перем Настройки;

////////////////////////////////////////////////////////////////////////////////
// Блок обработчиков событий формы и элементов формы
//

// Обработчик события "при создании на сервере" 
// Устанавливает даты начала и конца для загрузки курсов по умолчанию
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НачалоПериодаЗагрузки = НачалоМесяца(ТекущаяДата());
	Объект.ОкончаниеПериодаЗагрузки = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НачалоПериодаЗагрузки = НачалоМесяца(ТекущаяДата());
	ОкончаниеПериодаЗагрузки = КонецМесяца(ТекущаяДата());
	
	Элементы.НадписьДата.Заголовок = Формат(ТекущаяДата(), "ДЛФ=ДД");
	
	ВосстановитьНастройки();
	
	КодНеУказан = ПустаяСтрока(Объект.КодДоступа);
	Элементы.НадписьПояснение.Видимость = КодНеУказан;
	Элементы.НадписьПолучитьКод.Видимость = КодНеУказан;
	Элементы.ГруппаЗаДень.Видимость = КодНеУказан;
	Элементы.ГруппаЗаПериод.Видимость = Не КодНеУказан;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущиеНастройки = ПолучитьЗначениеКонстанты();
	Если ТипЗнч(ТекущиеНастройки.Получить()) = Тип("Структура") Тогда
		ТекущиеНастройки = ТекущиеНастройки.Получить();
	КонецЕсли;
	
	ЕстьРазличия = ПроверкаНаИзменениеДанных(ТекущиеНастройки);
	
	Если ЕстьРазличия Тогда
		
		Ответ = Вопрос(НСтр("ru='Изменились настройки загрузки (параметры, список валют и т.п.). Сохранить измененные настройки?';uk='Змінилися настройки завантаження (параметри, список валют і інше). Зберегти змінені настройки?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		ИначеЕсли  Ответ = КодВозвратаДиалога.Да Тогда
		    СохранитьНастройки();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "обработка выбора" формы
// Обрабатывает выбор валюты в форме выбора
//
&НаКлиенте
Процедура ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
	
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.Валюты") Тогда
		
		Если Объект.СписокВалют.НайтиСтроки(Новый Структура("Валюта", РезультатВыбора)).Количество() = 0 Тогда
			ДобавитьВалютуВСписок(РезультатВыбора);
		Иначе
			Предупреждение(НСтр("ru='Валюта уже присутствует в списке';uk=' Валюта вже присутня в списку'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодДоступаПриИзменении(Элемент)
	
	КодНекорректен = Ложь;
	
	Если НЕ ПустаяСтрока(Объект.КодДоступа) Тогда
	
		Если НЕ (СтрДлина(СокрЛП(Объект.КодДоступа)) = 32) Тогда
			КодНекорректен = Истина;
		Иначе
			Для ном=0 По СтрДлина(Объект.КодДоступа)-1 Цикл
				Символ = Сред(Объект.КодДоступа,ном,1);
				Если  Символ <> "a" И Символ <> "b" И Символ <> "c" И Символ <> "d" И Символ <> "e" И Символ <> "f"
					И Символ <> "0" И Символ <> "1" И Символ <> "2" И Символ <> "3" И Символ <> "4" И Символ <> "5"
					И Символ <> "6" И Символ <> "7" И Символ <> "8" И Символ <> "9" Тогда
						КодНекорректен = Истина;	
						Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли; 
	
	Если КодНекорректен Тогда
		Сообщить(НСтр("ru='Введен некорректный код доступа!';uk='Введено некоректний код доступу!'"));
		Сообщить(НСтр("ru='Попробуйте ввести код еще раз.';uk='Спробуйте ввести код ще раз.'"));
		Элементы.ГруппаЗаПериод.Видимость = Ложь;
		Элементы.ГруппаЗаДень.Видимость = Истина;
	Иначе
		Элементы.ГруппаЗаПериод.Видимость = Истина;
		Элементы.ГруппаЗаДень.Видимость = Ложь;
		НачалоПериодаЗагрузки = НачалоДня(ТекущаяДата());
		ОкончаниеПериодаЗагрузки = НачалоДня(ТекущаяДата());
	КонецЕсли; 
	Элементы.НадписьПояснение.Видимость = КодНекорректен;
	Элементы.НадписьПолучитьКод.Видимость = КодНекорректен;
	
КонецПроцедуры

// Обработчик события "перед началом добавления" элемента формы СписокВалют
// Вызывает форму выбора валют в режиме выбора
//
&НаКлиенте
Процедура СписокВалютПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПараметрыФорма = Новый Структура("ЗагружаемыеВалюты", Истина);
	ОткрытьФорму("Справочник.Валюты.ФормаВыбора", ПараметрыФорма, ЭтаФорма);
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события "выбор" табличной части "СписокВалют" формы
// Открывает форму валюты
//
&НаКлиенте
Процедура СписокВалютВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Элементы.СписокВалют.ТекущиеДанные.Валюта);
	
КонецПроцедуры

// Обработчик события нажания на кнопку "Очистить"
// Очищает список валют
//
&НаКлиенте
Процедура КомандаОчиститьВыполнить()
	
	Объект.СписокВалют.Очистить();
	
КонецПроцедуры

// Обработчик нажатия на кнопку "Заполнить"
// Вызывает функциональность заполнения списка валют
//
&НаКлиенте
Процедура КомандаЗаполнитьСписокВалютВыполнить()
	
	ЗаполнитьВалюты();
	
КонецПроцедуры

// Обработчик нажатия на кнопку "Подбор"
// Вызывает форму выбора валют в режиме подбора
//
&НаКлиенте
Процедура КомандаПодборВалютВыполнить()
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, Отбор", Ложь, Новый Структура("ЗагружаетсяИзИнтернета", Истина));
	ОткрытьФорму("Справочник.Валюты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// Обработчик нажаитя на кнопку "Загрузить"
// Вызывает функциональность загрузки курсов
//
&НаКлиенте
Процедура КомандаЗагрузитьВыполнить()
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериодаЗагрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Не задана дата начала периода загрузки.';uk='Не задана дата початку періоду завантаження.'"), ,
					"Объект.НачалоПериодаЗагрузки");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ОкончаниеПериодаЗагрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Не задана дата окончания периода загрузки.';uk='Не задана дата закінчення періоду завантаження.'"), ,
					"Объект.ОкончаниеПериодаЗагрузки");
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокВалют.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Для загрузки курсов с веб-сервера finance.ua необходимо добавить в список хотя бы одну валюту.';uk=' Для завантаження курсів з веб-сервера finance.ua необхідно додати в список хоча б одну валюту.'"), ,
					"Объект.СписокВалют");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Состояние(НСтр("ru='Загружаются курсы валют...';uk='Завантажуються курси валют...'"));
	ПоясняющееСообщение = "";
	СтатусОперации = ЗагрузитьКурсыСРБК(ПоясняющееСообщение);
	
	Если СтатусОперации Тогда
		Оповестить("ИзменениеКурсовВалют");
		ТекстСообщенияОЗавершенииЗагрузки = НСтр("ru='Загрузка курсов валют завершена.';uk='Завантаження курсів валют завершена.'");
		Если ЗначениеЗаполнено(ПоясняющееСообщение) Тогда
			ТекстСообщенияОЗавершенииЗагрузки = ТекстСообщенияОЗавершенииЗагрузки + Символы.ПС
										+ ПоясняющееСообщение;
		КонецЕсли;
		Состояние(ТекстСообщенияОЗавершенииЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "Получить полный код" командной панели
&НаКлиенте
Процедура НадписьПолучитьКодНажатие(Элемент)
	
	ОткрытьСайтФинансУа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиФинансУаНажатие(Элемент)
	
	ОткрытьСайтФинансУа();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Секция служебных процедур
//

&НаСервере
Процедура ВосстановитьНастройки()
	
	Попытка
		ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
		Если ТипЗнч(ЗначениеКонстанты.Получить()) = Тип("Структура") Тогда
			Настройки = ЗначениеКонстанты.Получить();
		КонецЕсли;
		
		Объект.КодДоступа = Настройки.КодДоступа;
		
		Валюты = Настройки.СписокВалют;
		Если Валюты = Неопределено Тогда
			ЗаполнитьВалюты();
		ИначеЕсли Валюты.Количество() = 0 Тогда
			ЗаполнитьВалюты();
		Иначе	 
			Объект.СписокВалют.Очистить();
			Для сч=0 По Валюты.Количество()-1 Цикл
				ДобавитьВалютуВСписок(Валюты[сч])
			КонецЦикла;
		КонецЕсли; 
		
		Если СокрЛП(Объект.КодДоступа) <> "" Тогда
			Элементы.ГруппаЗаПериод.Видимость = Истина;
			Элементы.ГруппаЗаДень.Видимость = Ложь;
		Иначе
			Элементы.ГруппаЗаПериод.Видимость = Ложь;
			Элементы.ГруппаЗаДень.Видимость = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если Настройки = Неопределено Тогда
		Настройки = Новый Структура("КодДоступа, СписокВалют");	
	КонецЕсли;
	
	Настройки.Вставить("КодДоступа", Объект.КодДоступа);
	
	Валюты = Новый Массив;
	Для Каждого Строка Из Объект.СписокВалют Цикл
		Если Строка.Валюта.ЗагружаетсяИзИнтернета Тогда
			Валюты.Добавить(Строка.Валюта);
		КонецЕсли; 
	КонецЦикла;
	Настройки.Вставить("СписокВалют", Валюты);
	
	ХранилищеНастроек = Новый ХранилищеЗначения(Настройки);
	Попытка
		Константы.НастройкиЗагрузкиКурсовВалют.Установить(ХранилищеНастроек);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайтФинансУа() Экспорт
	
	ЗапуститьПриложение("http://1c.finance.ua");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеКонстанты()

	 Возврат Константы.НастройкиЗагрузкиКурсовВалют.Получить();

КонецФункции

&НаСервере
Функция ПроверкаНаИзменениеДанных(ТекущиеНастройки)

	ЕстьРазличия = Истина;
	Пока Истина Цикл
		
		Если НЕ ТипЗнч(ТекущиеНастройки.Получить()) = Тип("Структура") Тогда
			Прервать;
		КонецЕсли;
		
		ТекущиеНастройки = ТекущиеНастройки.Получить();
		
		Если НЕ Объект.КодДоступа 	= ТекущиеНастройки.КодДоступа Тогда
			Прервать;
		КонецЕсли;
		
		ЕстьРазличияВСпискахВалют = Ложь;
		ТекущиеВалюты = ТекущиеНастройки.СписокВалют;
		Если ТекущиеВалюты = Неопределено Тогда
			Прервать;
		КонецЕсли; 
		СписокВалютКопия = Объект.СписокВалют.Выгрузить();
		
		Для каждого НеЗагружаемыйКурс Из СписокВалютКопия Цикл
			Если Не НеЗагружаемыйКурс.Валюта.ЗагружаетсяИзИнтернета Тогда
				СписокВалютКопия.Удалить(НеЗагружаемыйКурс);
			КонецЕсли; 
		КонецЦикла;
		
		Для Каждого ТекВалюта Из ТекущиеВалюты Цикл
			
			СтрокаВалют = СписокВалютКопия.Найти(ТекВалюта);
			Если СтрокаВалют = Неопределено Тогда
				ЕстьРазличияВСпискахВалют = Истина;
			Иначе
				СписокВалютКопия.Удалить(СтрокаВалют);
			КонецЕсли;
				
		КонецЦикла;
		Если СписокВалютКопия.Количество() > 0 Тогда
			ЕстьРазличияВСпискахВалют = Истина;
		КонецЕсли;
		
		Если ЕстьРазличияВСпискахВалют Тогда
			Прервать;
		КонецЕсли;
		
		ЕстьРазличия = Ложь;
		Прервать;
	КонецЦикла; 

	Возврат ЕстьРазличия;
	
КонецФункции

&НаКлиенте
Функция ЗагрузитьКурсыСРБК(ПоясняющееСообщение)
	
	ПоясняющееСообщение = "";
	
#Если ВебКлиент Тогда
	СтатусОперации = ЗагрузитьКурсыСРБК_Сервер(
			Объект.СписокВалют,
			Объект.НачалоПериодаЗагрузки,
			Объект.ОкончаниеПериодаЗагрузки,
			Объект.КодДоступа,
			ПоясняющееСообщение);
#Иначе
	СтатусОперации = РаботаСКурсамиВалютКлиентСервер.ЗагрузитьКурсыВалютПоПараметрам(
				Объект.СписокВалют,
				Объект.НачалоПериодаЗагрузки,
				Объект.ОкончаниеПериодаЗагрузки,
				Объект.КодДоступа,
				ПоясняющееСообщение);
#КонецЕсли
	
	Если Не СтатусОперации Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПоясняющееСообщение);
	Иначе
		ОбновитьСведенияВСпискеВалют();
	КонецЕсли;
	
	Возврат СтатусОперации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьКурсыСРБК_Сервер(знач СписокВалют, знач НачалоПериодаЗагрузки, знач ОкончаниеПериодаЗагрузки, знач КодДоступа, ПоясняющееСообщение)
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ЗагрузитьКурсыВалютПоПараметрам(
				СписокВалют, НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки, КодДоступа, ПоясняющееСообщение);
	
КонецФункции

// Процедура заполняет табличную часть списком валют. В список попадают только 
// валюты, курс которых не зависит от курса других валют.
//
&НаСервере
Процедура ЗаполнитьВалюты()
	
	ОкончаниеПериодаЗагрузки = Объект.ОкончаниеПериодаЗагрузки;
	СписокВалют = Объект.СписокВалют;
	СписокВалют.Очистить();
	
	ЗагружаемыеВалюты = РаботаСКурсамиВалют.ПолучитьМассивЗагружаемыхВалют();
	
	Для Каждого ЭлементВалюта Из ЗагружаемыеВалюты Цикл
		ДобавитьВалютуВСписок(ЭлементВалюта);
	КонецЦикла;
	
КонецПроцедуры

// Процедура добавляет в список валют новую строку и заполняет ее информацией
// о курсе на основе ссылки на валюту
//
// Параметры:
// Валюта - Справочник.Валюты / Ссылка - ссылка на валюту, которая добавляется
//                 в список
//
&НаСервере
Процедура ДобавитьВалютуВСписок(Валюта)
	
	НоваяСтрока = Объект.СписокВалют.Добавить();
	ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(НоваяСтрока, Валюта);
	
КонецПроцедуры

// Процедура обновляет записи о курсах валют в списке.
//
&НаСервере
Процедура ОбновитьСведенияВСпискеВалют()
	
	Для Каждого СтрокаДанных Из Объект.СписокВалют Цикл
		СсылкаНаВалюту = СтрокаДанных.Валюта;
		ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(СтрокаДанных, СсылкаНаВалюту);
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет строку табличной части информацией о курсе на основе
// ссылки на валюту.
//
// Параметры:
// ТекСтрока       - ДанныеФормыЭлементКоллекции - ссылка на строку табличной
//                  части, которую необходимо заполнить информацией о курсе 
//                  валюты
// ВыбраннаяВалюта - Справочник.Валюты / Ссылка - ссылка на валюту, информацию
//                  о которой необходимо получить.
//
&НаСервере
Процедура ЗаполнитьДанныеСтрокиТаблицыНаОсновеВалюты(ТекСтрока, СсылкаНаВалюту);
	
	ТекСтрока.Валюта = СсылкаНаВалюту;
	ТекСтрока.КодВалюты = СсылкаНаВалюту.Код;
	
	ДанныеКурса = РаботаСКурсамиВалют.ЗаполнитьДанныеКурсаДляВалюты(СсылкаНаВалюту);
	
	Если ТипЗнч(ДанныеКурса) = Тип ("Структура") Тогда
		ТекСтрока.ДатаКурса = ДанныеКурса.ДатаКурса;
		ТекСтрока.Курс      = ДанныеКурса.Курс;
		ТекСтрока.Кратность = ДанныеКурса.Кратность;
	КонецЕсли;
	
КонецПроцедуры


// Структура хранит настройки обработки:
// - КодДоступа			: 32 значный код доступа к платным сервисам
// - СписокВалют		: Массив содержащий коды валют, для которых необходимо загружать курсы
Настройки = Новый Структура("КодДоступа, СписокВалют");
